#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.azs: Reading...
module.s3_bucket.data.aws_partition.current: Reading...
module.s3_bucket.data.aws_canonical_user_id.this[0]: Reading...
module.s3_bucket.data.aws_region.current: Reading...
module.s3_bucket.data.aws_caller_identity.current: Reading...
module.my-vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0bd98ff8727c00666]
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=eu-west-3]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 1s [id=227522807132]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Read complete after 1s [id=9c6f13d42f083fadc8e8b04f0227f7fa1ebe85ab99305ff9a16899ed7c9a90be]
data.aws_availability_zones.azs: Read complete after 1s [id=eu-west-3]
module.my-vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0430c0dd532fdb460]
module.my-vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06b7ebce9ba877de0]
module.my-vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-040222db388de4242]
module.my-vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-039d8ef65b7ffa9cb]
module.my-vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c254ec5464cef049]
module.my-vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0fb627c4e0405645c]
module.my-vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0813b10b9172577db]
module.my-vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-03a91bc2105d84eb1]
module.my-vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-059916b89bf88bd3b]
module.my-vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0259d4a440338abfe]
module.my-vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-091f32cbc99ac4dc2]
module.my-vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-087ff0990e7ff97bf]
module.my-vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-007ea1c52ebf7f6fc]
module.my-vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-059916b89bf88bd3b1080289494]
module.my-vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07a9c39af04cf5f13]
module.my-vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-04c23aaf028db455f]
module.my-vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b695e9b9ce80720a]
module.my-vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0bce3e03db5ac87dd]
module.my-vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0a7d82ebfe0e2076f]
module.my-vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-086904816e45dda86]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.my-vpc.aws_eip.nat[0] is tainted, so must be replaced
-/+ resource "aws_eip" "nat" {
      ~ allocation_id            = "eipalloc-007ea1c52ebf7f6fc" -> (known after apply)
      ~ arn                      = "arn:aws:ec2:eu-west-3:227522807132:elastic-ip/eipalloc-007ea1c52ebf7f6fc" -> (known after apply)
      + association_id           = (known after apply)
      + carrier_ip               = (known after apply)
      + customer_owned_ip        = (known after apply)
      ~ id                       = "eipalloc-007ea1c52ebf7f6fc" -> (known after apply)
      + instance                 = (known after apply)
      + ipam_pool_id             = (known after apply)
      ~ network_border_group     = "eu-west-3" -> (known after apply)
      + network_interface        = (known after apply)
      + private_dns              = (known after apply)
      + private_ip               = (known after apply)
      + ptr_record               = (known after apply)
      ~ public_dns               = "ec2-15-237-35-162.eu-west-3.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                = "15.237.35.162" -> (known after apply)
      ~ public_ipv4_pool         = "amazon" -> (known after apply)
        tags                     = {
            "Name"                                 = "my-vpc-eu-west-3a"
            "kubernetes.io/cluster/my-eks-cluster" = "shared"
        }
      ~ vpc                      = true -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.my-vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-087ff0990e7ff97bf"
      + tags                               = {
          + "Name"                                 = "my-vpc-eu-west-3a"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
        }
      + tags_all                           = {
          + "Name"                                 = "my-vpc-eu-west-3a"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
        }
    }

  # module.my-vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-06b7ebce9ba877de0"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.s3_bucket.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "nasa-data-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_ownership_controls.this[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_bucket.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 8 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + bucket_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @jingxp, Action: `pull_request`*